py32-rs/py32-data/svd/PY32F002Zxx.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Puya</vendor>
  <vendorID>Puya</vendorID>
  <name>PY32F002Zxx</name>
  <series>PY32F0</series>
  <version>1.0.0</version>
  <description>Arm 32-bit Cortex-M0+ Microcontroller based device, CPU clock up to 48 MHz.</description>
  <cpu>
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>Analog to Digital Converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40012400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC</name>
        <description>ADC Interrupts</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>ADC interrupt and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EOSMP</name>
              <description>ADC group regular end of sampling flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EOC</name>
              <description>ADC group regular end of unitary conversion flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EOSEQ</name>
              <description>ADC group regular end of sequence conversions flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OVR</name>
              <description>ADC group regular overrun flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AWD</name>
              <description>ADC analog watchdog flag</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>ADC interrupt enable register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>EOSMPIE</name>
              <description>ADC group regular end of sampling interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EOCIE</name>
              <description>ADC group regular end of unitary conversion interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EOSEQIE</name>
              <description>ADC group regular end of sequence conversions interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OVRIE</name>
              <description>ADC group regular overrun interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AWDIE</name>
              <description>ADC analog watchdog interrupt</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>ADC control register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADEN</name>
              <description>ADC enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADDIS</name>
              <description>ADC enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADSTART</name>
              <description>ADC group regular conversion start</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADSTP</name>
              <description>ADC group regular conversion stop</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>VREF_BUFFERE</name>
              <description>desc VREF_BUFFERE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VERBUFF_SEL</name>
              <description>desc VERBUFF_SEL</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>ADCAL</name>
              <description>ADC group regular conversion calibration</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1</name>
          <displayName>CFGR1</displayName>
          <description>ADC configuration register 1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SCANDIR</name>
              <description>Scan sequence direction</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RESSEL</name>
              <description>ADC data resolution</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>ALIGN</name>
              <description>ADC data alignement</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EXTSEL</name>
              <description>ADC group regular external trigger source</description>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>EXTEN</name>
              <description>ADC group regular external trigger polarity</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>OVRMOD</name>
              <description>ADC group regular overrun configuration</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CONT</name>
              <description>ADC group regular continuous conversion mode</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WAIT</name>
              <description>Wait conversion mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DISCEN</name>
              <description>ADC group regular sequencer discontinuous mode</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AWDSGL</name>
              <description>ADC analog watchdog monitoring a single channel or all channels</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>AWDEN</name>
              <description>ADC analog watchdog enable on scope ADC group regular</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>AWDCH</name>
              <description>ADC analog watchdog monitored channel selection</description>
              <bitRange>[29:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>ADC configuration register 2</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>CKMODE</name>
              <description>ADC clock mode</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR</name>
          <displayName>SMPR</displayName>
          <description>ADC sampling time register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SMP</name>
              <description>Sampling time selection</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <displayName>TR</displayName>
          <description>ADC analog watchdog 1 threshold register</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0xFFF0000</resetValue>
          <fields>
            <field>
              <name>LT</name>
              <description>ADC analog watchdog threshold low</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>HT</name>
              <description>ADC analog watchdog threshold high</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSELR</name>
          <displayName>CHSELR</displayName>
          <description>ADC group regular sequencer register</description>
          <addressOffset>0x28</addressOffset>
          <resetValue>0xFFF0000</resetValue>
          <fields>
            <field>
              <name>CHSEL0</name>
              <description>Channel-0 selection</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHSEL1</name>
              <description>Channel-1 selection</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHSEL2</name>
              <description>Channel-2 selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHSEL3</name>
              <description>Channel-3 selection</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHSEL4</name>
              <description>Channel-4 selection</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHSEL5</name>
              <description>Channel-5 selection</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSEL6</name>
              <description>Channel-6 selection</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSEL7</name>
              <description>Channel-7 selection</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSEL8</name>
              <description>Channel-8 selection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHSEL9</name>
              <description>Channel-9 selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>ADC group regular data register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>ADC group regular conversion data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSR</name>
          <displayName>CCSR</displayName>
          <description>ADC calibration configuration and status register</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>CALSEL</name>
              <description>Calibration contents selection</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CALSMP</name>
              <description>Calibration sample time selection</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>CALBYP</name>
              <description>desc CALBYP</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CALSET</name>
              <description>Calibration factor selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OFFSUC</name>
              <description>desc OFFSUC</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CALSUC</name>
              <description>desc CALSUC</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CALON</name>
              <description>Calibration flag</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>ADC common configuration register</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>VREFEN</name>
              <description>VREFINT enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TSEN</name>
              <description>Temperature sensor enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
