py32-rs/py32-data/svd/PY32F002Zxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <displayName>CFGR1</displayName>
          <description>SYSCFG configuration register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>Memory mapping selection bits</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C_PA2_FMP</name>
              <description>desc I2C_PA2_FMP</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C_PB3_FMP</name>
              <description>desc I2C_PB3_FMP</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>I2C_PB4_FMP</name>
              <description>desc I2C_PB4_FMP</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C_PB6_FMP</name>
              <description>desc I2C_PB6_FMP</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>SYSCFG configuration register 2</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>Cortex-M0+ LOCKUP bit enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ETR_SRC_TIM1</name>
              <description>TIM1 ETR source selection</description>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_ENS</name>
          <description>desc GPIO_ENS</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <description>desc PA_ENS</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>PB_ENS</name>
              <description>desc PB_ENS</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PC_ENS</name>
              <description>desc PC_ENS</description>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TIM1</name>
      <description>Advanced timer</description>
      <groupName>TIM</groupName>
      <baseAddress>0x40012C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIM1_BRK_UP_TRG_COM</name>
        <description>TIM1 Break, Update, Trigger and Commutation Interrupt</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TIM1_CC</name>
        <description>TIM1 Capture Compare Interrupt</description>
        <value>14</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x0</addressOffset>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>CEN</name>
              <description>desc CEN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDIS</name>
              <description>desc UDIS</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>URS</name>
              <description>desc URS</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OPM</name>
              <description>desc OPM</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMS</name>
              <description>desc CMS</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ARPE</name>
              <description>desc ARPE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKD</name>
              <description>desc CKD</description>
              <bitRange>[9:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0x4</addressOffset>
          <resetMask>0xF8</resetMask>
          <fields>
            <field>
              <name>CCPC</name>
              <description>desc CCPC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CCUS</name>
              <description>desc CCUS</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MMS</name>
              <description>desc MMS</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TI1S</name>
              <description>desc TI1S</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OIS1</name>
              <description>desc OIS1</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OIS1N</name>
              <description>desc OIS1N</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OIS2</name>
              <description>desc OIS2</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OIS2N</name>
              <description>desc OIS2N</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OIS3</name>
              <description>desc OIS3</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>OIS3N</name>
              <description>desc OIS3N</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OIS4</name>
              <description>desc OIS4</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <description>desc SMCR</description>
          <addressOffset>0x8</addressOffset>
          <resetMask>0xFFF7</resetMask>
          <fields>
            <field>
              <name>SMS</name>
              <description>desc SMS</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCCS</name>
              <description>desc OCCS</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TS</name>
              <description>desc TS</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>MSM</name>
              <description>desc MSM</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ETF</name>
              <description>desc ETF</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ETPS</name>
              <description>desc ETPS</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>ECE</name>
              <description>desc ECE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ETP</name>
              <description>desc ETP</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <description>desc DIER</description>
          <addressOffset>0xC</addressOffset>
          <resetMask>0x5F5F</resetMask>
          <fields>
            <field>
              <name>UIE</name>
              <description>desc UIE</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IE</name>
              <description>desc CC1IE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IE</name>
              <description>desc CC2IE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IE</name>
              <description>desc CC3IE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IE</name>
              <description>desc CC4IE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMIE</name>
              <description>desc COMIE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIE</name>
              <description>desc TIE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BIE</name>
              <description>desc BIE</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x10</addressOffset>
          <resetMask>0x1E5F</resetMask>
          <fields>
            <field>
              <name>UIF</name>
              <description>desc UIF</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IF</name>
              <description>desc CC1IF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IF</name>
              <description>desc CC2IF</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IF</name>
              <description>desc CC3IF</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IF</name>
              <description>desc CC4IF</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMIF</name>
              <description>desc COMIF</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIF</name>
              <description>desc TIF</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BIF</name>
              <description>desc BIF</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC1OF</name>
              <description>desc CC1OF</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC2OF</name>
              <description>desc CC2OF</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3OF</name>
              <description>desc CC3OF</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4OF</name>
              <description>desc CC4OF</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC1IR</name>
              <description>desc IC1IR</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC2IR</name>
              <description>desc IC2IR</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IC3IR</name>
              <description>desc IC3IR</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IC4IR</name>
              <description>desc IC3IR</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <description>desc IC1IF</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <description>desc IC2IF</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <description>desc IC3IF</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <description>desc IC3IF</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <description>desc EGR</description>
          <addressOffset>0x14</addressOffset>
          <access>write-only</access>
          <resetMask>0x5F</resetMask>
          <fields>
            <field>
              <name>UG</name>
              <description>desc UG</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CC1G</name>
              <description>Capture/Compare 1 Generation</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CC2G</name>
              <description>desc CC2G</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CC3G</name>
              <description>desc CC3G</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CC4G</name>
              <description>desc CC4G</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>COMG</name>
              <description>desc COMG</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TG</name>
              <description>desc TG</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BG</name>
              <description>desc BG</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_OUTPUT</name>
          <description>desc CCMR1:OUTPUT</description>
          <addressOffset>0x18</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC1FE</name>
              <description>desc OC1FE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC1PE</name>
              <description>desc OC1PE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC1M</name>
              <description>desc OC1M</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC1CE</name>
              <description>desc OC1CE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <description>desc CC2S</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC2FE</name>
              <description>desc OC2FE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC2PE</name>
              <description>desc OC2PE</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2M</name>
              <description>desc OC2M</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC2CE</name>
              <description>desc OC2CE</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_INPUT</name>
          <description>desc CCMR1:INPUT</description>
          <alternateRegister>CCMR1_OUTPUT</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC1PSC</name>
              <description>desc IC1PSC</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC1F</name>
              <description>desc IC1F</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <description>desc CC2S</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2PSC</name>
              <description>desc IC2PSC</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IC2F</name>
              <description>desc IC2F</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2_OUTPUT</name>
          <description>desc CCMR2:OUTPUT</description>
          <addressOffset>0x1C</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CC3S</name>
              <description>desc CC3S</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC3FE</name>
              <description>desc OC3FE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC3PE</name>
              <description>desc OC3PE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC3M</name>
              <description>desc OC3M</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC3CE</name>
              <description>desc OC3CE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC4S</name>
              <description>desc CC4S</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC4FE</name>
              <description>desc OC4FE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC4PE</name>
              <description>desc OC4PE</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC4M</name>
              <description>desc OC4M</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC4CE</name>
              <description>desc OC4CE</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2_INPUT</name>
          <description>desc CCMR2:INPUT</description>
          <alternateRegister>CCMR2_OUTPUT</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CC3S</name>
              <description>desc CC3S</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC3PSC</name>
              <description>desc IC3PSC</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC3F</name>
              <description>desc IC3F</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CC4S</name>
              <description>desc CC4S</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4PSC</name>
              <description>desc IC4PSC</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IC4F</name>
              <description>desc IC4F</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
