py32-rs/py32-data/svd/PY32F002Zxx.svd
        <register>
          <name>CCER</name>
          <description>desc CCER</description>
          <addressOffset>0x20</addressOffset>
          <resetMask>0x3333</resetMask>
          <fields>
            <field>
              <name>CC1E</name>
              <description>desc CC1E</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1P</name>
              <description>desc CC1P</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC1NE</name>
              <description>desc CC1NE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC1NP</name>
              <description>desc CC1NP</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC2E</name>
              <description>desc CC2E</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CC2P</name>
              <description>desc CC2P</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CC2NE</name>
              <description>desc CC2NE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CC2NP</name>
              <description>desc CC2NP</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC3E</name>
              <description>desc CC3E</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC3P</name>
              <description>desc CC3P</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC3NE</name>
              <description>desc CC3NE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3NP</name>
              <description>desc CC3NP</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4E</name>
              <description>desc CC4E</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CC4P</name>
              <description>desc CC4P</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>desc CNT</description>
          <addressOffset>0x24</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>desc PSC</description>
          <addressOffset>0x28</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PSC</name>
              <description>desc PSC</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <description>desc ARR</description>
          <addressOffset>0x2C</addressOffset>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ARR</name>
              <description>desc ARR</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCR</name>
          <description>desc RCR</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>REP</name>
              <description>desc REP</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>desc CCR1</description>
          <addressOffset>0x34</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR1</name>
              <description>desc CCR1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>desc CCR2</description>
          <addressOffset>0x38</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR2</name>
              <description>desc CCR2</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>desc CCR3</description>
          <addressOffset>0x3C</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR3</name>
              <description>desc CCR3</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <description>desc CCR4</description>
          <addressOffset>0x40</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR4</name>
              <description>desc CCR4</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTR</name>
          <description>desc BDTR</description>
          <addressOffset>0x44</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DTG</name>
              <description>desc DTG</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>desc LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSSI</name>
              <description>desc OSSI</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OSSR</name>
              <description>desc OSSR</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKE</name>
              <description>desc BKE</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKP</name>
              <description>desc BKP</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AOE</name>
              <description>desc AOE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MOE</name>
              <description>desc MOE</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
